from pathlib import Path
import torch
from decouple import config


BASE_DIR = Path(__file__).resolve().parents[1]
WEIGHTS_FILENAME = config('WEIGHTS_FILENAME')
WEIGHTS_PATH = BASE_DIR / "weights" / WEIGHTS_FILENAME

DEVICE = "cuda" if torch.cuda.is_available() else "cpu"

NUM_CLASSES = 6
NUM_SUBCLASSES = [8, 5, 9, 10, 5, 3]

CLASS_NAMES = {
    0: "Графика",
    1: "Скульптуры",
    2: "Декоративно-прикладное искусство",
    3: "Живопись",
    4: "Архитектура",
    5: "Инсталляции",
}

SUBCLASS_NAMES = {
    0: {
        0: "Граффити",
        1: "Портрет",
        2: "Укиё-э",
        3: "Пейзаж",
        4: "Карикатура",
        5: "Плакат",
        6: "Шарж",
        7: "Прикладная графика",
    },
    1: {
        0: "Мифологическая скульптура",
        1: "Символическая скульптура",
        2: "Бытовая скульптура",
        3: "Портретная скульптура",
        4: "Анималистическая скульптура",
    },
    2: {
        0: "Керамика",
        1: "Кружево",
        2: "Ювелирное искусство",
        3: "Мозаика",
        4: "Батик",
        5: "Гобелен",
        6: "Резьба по дереву",
        7: "Резьба по камню",
        8: "Ковер",
    },
    3: {
        0: "Пейзаж",
        1: "Натюрморт",
        2: "Абстракция",
        3: "Портрет",
        4: "Историческая живопись",
        5: "Бытовая живопись",
        6: "Батальная живопись",
        7: "Анималистическая живопись",
        8: "Религиозная живопись",
        9: "Мифологическая живопись",
    },
    4: {
        0: "Дорический ордер",
        1: "Ионический ордер",
        2: "Композитный ордер",
        3: "Тосканский ордер",
        4: "Коринфский ордер",
    },
    5: {
        0: "Визуально-визионерская инсталляция",
        1: "Объектно-предметная инсталляция",
        2: "Сюжетно-повествовательная инсталляция",
    },
}
